{
  "dataPubblicazione": 1760572800000,
  "redazionale": "TX25ADD10019",
  "numeroGU": 123,
  "emettitori": [
    {
      "nome": "DOMPE' FARMACEUTICI S.P.A.",
      "informazioni": "\n           Sede legale: via San Martino, 12 - 20122 Milano \n                      Codice Fiscale: 00791570153 \n                       Partita IVA: 00791570153 "
    }
  ],
  "permalink": "https://www.gazzettaufficiale.it/eli/id/2025/10/16/TX25ADD10019/p2 ",
  "titolo": " \nModifiche minori di un'autorizzazione all'immissione in commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                s.m.i. e del D.Lgs. 219/2006 e s.m.i. \n \n",
  "testo": " \nModifiche minori di un'autorizzazione all'immissione in commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                s.m.i. e del D.Lgs. 219/2006 e s.m.i. \n \n\n  Medicinale: OKI 80 mg granulato per soluzione orale \n  Codice AIC: 028511210; 028511222 ; 028511095 \n  Codice Pratica: N1B/2025/792 \n  Tipologia di  variazione:  Grouping  di  tipo  IB:  B.II.a.3.z  (IB\nunforeseen), \n  B.II.b.3.a (IB), B.II.d.1.z (IB unforeseen), B.II.d.2.a (IA) \n  Modifica apportata: Modifica della composizione del prodotto finito\nper  la  riduzione  del  quantitativo  degli   eccipienti   Mannitolo\n(Diluent) e  Povidone  (Binder);  Modifica  minore  del  processo  di\nproduzione del prodotto finito; Modifica dei limiti per il test \"Peso\nMedio\" del prodotto finito; Modifica minore ad una procedura di prova\napprovata  per  il  prodotto  finito  per  aggiungere   una   colonna\nalternativa all'attuale registrata per il metodo UPLC. \n  Titolare AIC: Dompe' farmaceutici S.p.A. \n  In applicazione della Determina del Direttore  Tecnico  Scientifico\nn°95/2024 del 24/05/2024, relativa all'attuazione  del  comma  1-bis,\narticolo 35, del decreto legislativo 24 aprile 2006, n.219 e s.m.i, a\nseguito  della  variazione  sopra  riportata,  sono  modificati   gli\nstampati (paragrafo  6.5  del  Riassunto  delle  Caratteristiche  del\nProdotto), relativamente al medicinale indicato e la  responsabilita'\nsi ritiene affidata alla Societa' Titolare dell'AIC. \n  Il Titolare dell'AIC deve apportare  le  modifiche  autorizzate  al\nRiassunto delle Caratteristiche del Prodotto a partire dalla data  di\npubblicazione in Gazzetta Ufficiale della  Repubblica  Italiana-Parte\nSeconda della variazione. \n  Sia i lotti gia' prodotti alla data di  pubblicazione  in  Gazzetta\nUfficiale della Repubblica Italiana-Parte Seconda  della  variazione,\nche i lotti prodotti entro sei mesi dalla stessa data, non recanti le\nmodifiche autorizzate, possono essere  mantenuti  in  commercio  fino\nalla data di scadenza del medicinale indicata in etichetta. \n\n                           Un procuratore \n                          Elisabetta Rossi \n\n \nTX25ADD10019\n"
}