{
  "dataPubblicazione": 1765843200000,
  "redazionale": "TX25ADD12158",
  "numeroGU": 148,
  "emettitori": [
    {
      "nome": "DOC GENERICI S.R.L.",
      "informazioni": "\n              Sede legale: via Turati 40 - 20121 Milano \n                      Codice Fiscale: 11845960159 "
    }
  ],
  "permalink": "https://www.gazzettaufficiale.it/eli/id/2025/12/16/TX25ADD12158/p2 ",
  "titolo": " \n           Estratto comunicazione di notifica regolare PPA \n \n",
  "testo": " \n           Estratto comunicazione di notifica regolare PPA \n \n\n  Medicinale: PERINDOPRIL E AMLODIPINA DOC Generici \n  Codice Pratica: C1B/2025/1684 \n  Confezioni AIC: 044161026 \n  Tipologia variazioni: IB B.II.f.1.a.1, IB B.II.f.1.d \n  Titolare AIC: DOC Generici S.r.l. \n  Procedura Europea N°: IT/H/0526/IB/014/G \n  Tipo di Modifica: Modifica stampati \n  Modifica apportata: riduzione della  durata  di  conservazione  del\nprodotto finito da 24 mesi a 15 mesi per  il  dosaggio  da  4mg/10mg;\nmodifica delle condizioni di conservazione  del  prodotto  finito  da\n\"Questo medicinale non richiede  alcuna  temperatura  particolare  di\nconservazione\" a \"Non conservare a temperatura superiore a 25°C\"  per\nil dosaggio da 4mg/10mg. \n  E' autorizzata la modifica degli stampati richiesta (paragrafi  6.3\ne 6.4 del RCP e corrispondenti paragrafi del FI  e  delle  Etichette)\nrelativamente alle confezioni sopra elencate e la responsabilita'  si\nritiene affidata alla Azienda titolare dell'AlC. \n  ll Titolare AIC deve apportare le modifiche autorizzate, dalla data\ndi pubblicazione in G.U.R.I, al Riassunto delle  Caratteristiche  del\nProdotto; entro e non oltre i sei mesi dalla medesima data al  Foglio\nIllustrativo e all'Etichettatura. \n  I farmacisti  sono  tenuti  a  consegnare  il  Foglio  Illustrativo\naggiornato agli utenti,  che  scelgono  la  modalita'  di  ritiro  in\nformato cartaceo o analogico o mediante l'utilizzo di metodi digitali\nalternativi, a decorrere dal termine di 30 giorni  dalla  data  della\npresente  pubblicazione.  Il  titolare  AIC  rende   accessibile   al\nfarmacista  il  Foglio  Illustrativo  aggiornato  entro  il  medesimo\ntermine. I lotti  in  giacenza  possono  essere  immessi  nel  canale\ndistributivo entro e non oltre il 180°  giorno  successivo  a  quello\ndella pubblicazione in G.U.R.I.  Il  titolare  dell'AIC  ha  comunque\nl'obbligo di ritirare i lotti  che  progressivamente  arriveranno  al\ntermine del nuovo periodo di validita' pari a 15 mesi. \n\n                           Un procuratore \n                       dott.ssa Marta Bragheri \n\n \nTX25ADD12158\n"
}