{
  "dataPubblicazione": 1757376000000,
  "redazionale": "TX25ADD8738",
  "numeroGU": 107,
  "emettitori": [
    {
      "nome": "LABORATORIO FARMACEUTICO SIT S.R.L.",
      "informazioni": "\n                  Sede: via Cavour, 70 - Mede (PV) \n                       Partita IVA: 01467050181 "
    }
  ],
  "permalink": "https://www.gazzettaufficiale.it/eli/id/2025/09/09/TX25ADD8738/p2 ",
  "titolo": " \nModifica minore di un'autorizzazione all'immissione in  commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                s.m.i. e del D.Lgs. 219/2006 e s.m.i. \n \n",
  "testo": " \nModifica minore di un'autorizzazione all'immissione in  commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                s.m.i. e del D.Lgs. 219/2006 e s.m.i. \n \n\n  Medicinale: TRIPTIZOL (AIC: 019803) \n  Confezione: 019803 028 - 10 mg compresse rivestite - 30 compresse \n  019803 016 - 25 mg compresse rivestite - 25 compresse \n  Codice pratica N° N1B/2025/748 \n  N° e Tipologia variazione: Grouping di variazioni: 1 x  B.II.d.1.c,\n1 x B.II.b.2.a, 1 x B.II.f.1.a.1 - Tipo IB. \n  Modifica apportata: Aggiunta di un  nuovo  parametro  di  specifica\nalla specifica con il corrispondente metodo di prova; Aggiunta di  un\nsito in cui si effettuano il controllo  dei  lotti/le  prove  (Chelab\nS.r.l.); Riduzione della durata di conservazione del prodotto  finito\n- cosi' come confezionato per la vendita (da 5 anni a 3 anni). \n  Titolare AIC: Laboratorio  Farmaceutico  SIT  Specialita'  Igienico\nTerapeutiche S.r.l. \n  In applicazione della Determina del Direttore  Tecnico  Scientifico\nn° 95/2024 del 24/05/2024, relativa all'attuazione del  comma  1-bis,\narticolo 35, del decreto legislativo 24 aprile 2006, n. 219 e s.m.i.,\na seguito della  variazione  sopra  riportata,  sono  modificati  gli\nstampati (paragrafo  6.3  del  Riassunto  delle  Caratteristiche  del\nProdotto) relativamente al medicinale indicato e  la  responsabilita'\nsi ritiene affidata alla Societa' titolare dell'AIC. \n  Il titolare dell'AIC deve apportare  le  modifiche  autorizzate  al\nRiassunto delle Caratteristiche del Prodotto entro e non oltre i  sei\nmesi  dalla  data  di  pubblicazione  in  Gazzetta  Ufficiale   della\nRepubblica Italiana - Parte Seconda della variazione. \n  Sia i lotti gia' prodotti alla data di  pubblicazione  in  Gazzetta\nUfficiale della Repubblica Italiana - Parte Seconda della variazione,\nche i lotti prodotti entro sei mesi dalla stessa data, non recanti le\nmodifiche autorizzate, possono essere  mantenuti  in  commercio  fino\nalla data di scadenza del medicinale indicata in etichetta. \n  La presente variazione puo' assumersi  come  approvata  dal  giorno\nsuccessivo alla data della sua pubblicazione  in  Gazzetta  Ufficiale\ndella Repubblica Italiana. \n\n                      Il legale rappresentante \n                dott. Lamberto Matteo Pedrotti Catoni \n\n \nTX25ADD8738\n"
}