{
  "dataPubblicazione": 1769472000000,
  "redazionale": "TX26ADD754",
  "numeroGU": 10,
  "emettitori": [
    {
      "nome": "GENETIC S.P.A.",
      "informazioni": " "
    }
  ],
  "permalink": "https://www.gazzettaufficiale.it/eli/id/2026/01/27/TX26ADD754/p2 ",
  "titolo": " \n       Estratto comunicazione di notifica regolare ufficio PPA \n \n",
  "testo": " \n       Estratto comunicazione di notifica regolare ufficio PPA \n \n\n  Tipo di modifica: Modifica stampati \n  Codice Pratica N° N1B/2025/1087 \n  Medicinale: OCUSYNT 50 microgrammi/ml collirio, soluzione; \n  OCUSYNT  50  microgrammi/ml  collirio,  soluzione  in   contenitore\nmonodose \n  Codice farmaco: 038612 \n  Titolare AIC: Genetic S.p.A. \n  Tipologia variazione oggetto della modifica: 3 x IB; C.I.2.a \n  Modifica apportata: Modifica del Riassunto delle Caratteristiche di\nProdotto e dei corrispondenti paragrafi del  Foglio  illustrativo  in\nseguito alla valutazione delle stesse modifiche apportate al prodotto\ndi riferimento.  Modifica  del  Riassunto  delle  Caratteristiche  di\nProdotto, del Foglio  illustrativo  e  delle  Etichette  al  fine  di\nadeguare gli stampati al QRD template, agli Standard  terms  ed  alla\nLinea guida eccipienti. Accorpamento dei  testi  di  Riassunto  delle\nCaratteristiche di Prodotto e di Foglio illustrativo delle due  forme\nfarmaceutiche. Altre modifiche editoriali. \n  E' autorizzata, pertanto,  la  modifica  degli  stampati  richiesta\n(paragrafi 1, 2, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4,7,  4.8,  4.9,  5.1,\n5.2,  6.1,  6.3,  6.4  6.5,  6.6,  8  e   9   del   Riassunto   delle\nCaratteristiche del Prodotto e corrispondenti  paragrafi  del  Foglio\nIllustrativo e delle Etichette) relativamente alle  confezioni  sopra\nelencate e  la  responsabilita'  si  ritiene  affidata  alla  Azienda\ntitolare dell'AIC. Il Titolare dell'AIC deve apportare  le  modifiche\nautorizzate,  dalla  data  di  entrata  in  vigore   della   presente\nComunicazione   di   notifica   regolare,    al    Riassunto    delle\nCaratteristiche del Prodotto; entro e non  oltre  i  sei  mesi  dalla\nmedesima data al Foglio Illustrativo e all'Etichettatura. \n  Sia i lotti gia' prodotti alla data  di  entrata  in  vigore  della\npresente Comunicazione di notifica regolare che i lotti prodotti  nel\nperiodo di cui al precedente paragrafo della presente, non recanti le\nmodifiche autorizzate, possono essere  mantenuti  in  commercio  fino\nalla data  di  scadenza  del  medicinale  indicata  in  etichetta.  A\ndecorrere dal termine di 30 giorni dalla data di pubblicazione  nella\nG.U.R.I. della presente comunicazione, i  farmacisti  sono  tenuti  a\nconsegnare  il  Foglio  Illustrativo  aggiornato  agli  utenti,   che\nscelgono la modalita' di ritiro in formato  cartaceo  o  analogico  o\nmediante l'utilizzo di metodi digitali alternativi. Il  titolare  AIC\nrende accessibile al farmacista  il  Foglio  Illustrativo  aggiornato\nentro il medesimo termine. \n  La nuova indicazione terapeutica: \"Riduzione della PIO  elevata  in\npazienti pediatrici con  elevata  PIO  e  in  pazienti  con  glaucoma\npediatrico\" del medicinale, compresa  nella  variazione,  e'  ammessa\nalla rimborsabilita' a condizioni di classe e prezzo invariate. \n  E' approvata, altresi', secondo la lista dei termini standard della\nFarmacopea Europea, la denominazione delle  confezioni  da  riportare\nsugli stampati cosi' come indicata nell'oggetto. \n\n                      Il legale rappresentante \n                        Rocco Carmelo Pavese \n\n \nTX26ADD754\n"
}