{
  "dataPubblicazione": 1768608000000,
  "redazionale": "TX26ADD462",
  "numeroGU": 6,
  "emettitori": [
    {
      "nome": "COOPER CONSUMER HEALTH IT S.R.L.",
      "informazioni": "\n                      Partita IVA: 09896140010 "
    }
  ],
  "permalink": "https://www.gazzettaufficiale.it/eli/id/2026/01/17/TX26ADD462/p2 ",
  "titolo": " \nModifica minore di un'autorizzazione all'immissione in  commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                    s.m.i. e del D.Lgs. 219/2006 \n \n",
  "testo": " \nModifica minore di un'autorizzazione all'immissione in  commercio  di\nun medicinale per uso umano ai sensi del Regolamento  1234/2008/CE  e\n                    s.m.i. e del D.Lgs. 219/2006 \n \n\n  Titolare: Vemedia Manufacturing B.V. \n  Specialita' medicinale: MAGNESIA SAN PELLEGRINO \n  Codice AIC: 006570 in tutte le confezioni autorizzate \n  Codice Pratica: N1B/2025/1290 \n  Tipologia di  variazione:  raggruppamento  tipo  IB  di  variazioni\ncomposto da: 1 B.II.b.1.e, 2 B.II.b.1.a, 1 B.II.b.1.b, 2  B.II.b.2.a,\n1  B.II.b.1.c.1,  1  B.II.b.3.a,  1  B.II.b.4.b,  1   B.II.b.5.c,   1\nB.II.b.1.h, 1 B.II.e.1.a.1. \n  Modifiche  apportate:  sostituzione  del   sito   responsabile   di\nproduzione, confezionamento primario e secondario,  test  e  rilascio\nlotti del prodotto finito:  Vemedia  Manufacturing  B.V,  situato  in\nVerrijn Stuartweg 60,  1112  AX  Diemen,  Paesi  Bassi;  aggiunta  di\nEurofins Bactimm B.V. come sito  alternativo  per  il  controllo  del\nprodotto  finito;  aggiunta  di  De  Salute  Srl  come  sito  per  il\nconfezionamento secondario; riduzione  delle  dimensioni  del  lotto;\nmodifiche minori del processo  di  produzione  del  prodotto  finito;\ncambio del materiale di confezionamento primario. \n  In applicazione della Determina del Direttore  Tecnico  Scientifico\nn° 95/2024 del 4/05/2024, relativa all'attuazione  del  comma  1-bis,\narticolo 35, del decreto legislativo 24 aprile 2006, n. 219 e  s.m.i,\na seguito della  variazione  sopra  riportata,  sono  modificati  gli\nstampati, dove applicabile, relativamente al medicinale indicato e la\nresponsabilita' si ritiene affidata alla Societa' titolare  dell'AIC.\nIl Titolare dell'AIC  deve  apportare  le  modifiche  autorizzate  al\nRiassunto delle Caratteristiche del Prodotto a partire dalla data  di\npubblicazione in Gazzetta Ufficiale della Repubblica Italiana - Parte\nSeconda della variazione e al Foglio Illustrativo entro e non oltre i\nsei mesi dalla medesima data. Sia i lotti gia' prodotti alla data  di\npubblicazione in Gazzetta Ufficiale della Repubblica Italiana - Parte\nSeconda della variazione, che i lotti prodotti entro sei  mesi  dalla\nstessa data, non recanti le  modifiche  autorizzate,  possono  essere\nmantenuti in commercio fino alla  data  di  scadenza  del  medicinale\nindicata in etichetta. \n\n                           Un procuratore \n                        dott.ssa Silvia Costa \n\n \nTX26ADD462\n"
}